<div class="container">
    <div class="jumbotron">
        <h1>Привет, пользователь!</h1>
    </div>
</div>
<div class="text">
    <span>
        <p class="text1">
            Основная задача этой книги — научить вас создавать программы на языке C++,
            однако, разумеется, только этим мы не ограничимся. В последние несколько лет
            в сфере программного обеспечения произошел ряд значительных изменений,
            о которых мы расскажем чуть позже. Поэтому еще одна задача книги — изло-
            жить концепции языка C++ в контексте развития программного обеспечения.
        </p>
        <p class="text1">
            Новые концепции программирования
            Двадцать и более лет назад программисты реализовывали свои проекты путем
            непосредственного написания кода. С возрастанием размера и сложности проектов
            становилось все яснее, что такой подход неудачен. Проблема заключалась в не-
            пропорциональном возрастании сложности процесса создания самих программ.
            Пожалуй, большие программы можно без преувеличения назвать самым слож-
            ным творением человека. Из-за своей сложности такие программы нередко со-
            держат ошибки. Ошибки в программном обеспечении потенциально могут стать
            причиной материального ущерба, а иногда и угрожать жизни людей (например,
            при управлении авиа полетами). В результате борьбы с проблемой сложности
            программного кода были выработаны три новые концепции программирования:
        </p>
        <p class="text1">
            ♦ объектно-ориентированное программирование (ООП);
        </p>
        <p class="text1">
            ♦ унифицированный язык моделирования (UML);
        </p>
        <p class="text1">
            ♦ специализированные средства разработки программного обеспечения.
        </p>
        <p class="text1">
            В данной книге, наряду с изучением C++, уделяется внимание и упомяну-
            тым концепциям, что позволяет не просто выучить язык программирования, но
            и получить представление об эффективных способах разработки программного
            обеспечения.
        </p>
        <p class="text1">
            Объектно-ориентированное
            программирование
            Почему объектно-ориентированный подход к программированию стал приори-
            тетным при разработке большинства программных проектов? ООП предлагает
            новый мощный способ решения проблемы сложности программ. Вместо того
            чтобы рассматривать программу как набор последовательно выполняемых инст-
            рукций, в ООП программа представляется в виде совокупности объектов, обла-
            дающих сходными свойствами и набором действий, которые можно с ними про-
            изводить. Возможно, все то, о чем мы до сих пор говорили, будет казаться вам
            непонятным, пока вы не изучите соответствующий раздел программирования
            более подробно. Но со временем вы не раз сможете убедиться в том, что приме-
            нение объектно-ориентированного подхода делает программы понятнее, надеж-
            нее и проще в использовании.
        </p>
        <p class="text1">
            Объектно-ориентированное
            программирование
            Почему объектно-ориентированный подход к программированию стал приори-
            тетным при разработке большинства программных проектов? ООП предлагает
            новый мощный способ решения проблемы сложности программ. Вместо того
            чтобы рассматривать программу как набор последовательно выполняемых инст-
            рукций, в ООП программа представляется в виде совокупности объектов, обла-
            дающих сходными свойствами и набором действий, которые можно с ними про-
            изводить. Возможно, все то, о чем мы до сих пор говорили, будет казаться вам
            непонятным, пока вы не изучите соответствующий раздел программирования
            более подробно. Но со временем вы не раз сможете убедиться в том, что приме-
            нение объектно-ориентированного подхода делает программы понятнее, надеж-
            нее и проще в использовании.
        </p>
        <p class="text1">
            Объектно-ориентированное
            программирование
            Почему объектно-ориентированный подход к программированию стал приори-
            тетным при разработке большинства программных проектов? ООП предлагает
            новый мощный способ решения проблемы сложности программ. Вместо того
            чтобы рассматривать программу как набор последовательно выполняемых инст-
            рукций, в ООП программа представляется в виде совокупности объектов, обла-
            дающих сходными свойствами и набором действий, которые можно с ними про-
            изводить. Возможно, все то, о чем мы до сих пор говорили, будет казаться вам
            непонятным, пока вы не изучите соответствующий раздел программирования
            более подробно. Но со временем вы не раз сможете убедиться в том, что приме-
            нение объектно-ориентированного подхода делает программы понятнее, надеж-
            нее и проще в использовании.
        </p>
    </span>
</div>